print('Привіт! Це гра-вікторина. У тебе є на вибір 6 тем: фізика; математика; астрономія; біологія; хімія; відгадай італійську тварину. '
      'Та 3 важкості: легка; середня; важка. '
      'На кожну тему в залежності від важкості будуть запитання: 5 - легка;10 - середня; 15 - важка. '
      'Тобі будуть давати 3 варіанти відповіді на кожне запитання.'
      'Виключення 6 тема. Тобі дадуть 5 підказок та перед початком 3 варіанти, хто це може бути.')
theme = input('Вибери тему. 1 - фізика; 2 - математика; 3 - астрономія; 4 - біологія; 5 - хімія; 6 - італійська тварина: ')
if theme == '1' :
    diff1 = input('Чудово! Вибери важкість. 1 - легка;2 - середня; 3 - важка: ')
    if diff1 == '1' :
        points = 0
        print(' Гаразд! Ось запитання.')
        q11 = input('Яка одиниця вимірювання сили в СІ? 1. Паскаль; 2. Ньютон; 3. Джоуль: ')
        if q11 == '2' :
            print('Правильна відповідь.')
            points += 1
        else :
            print('Невірна відповідь')
        q21 = input('Яке явище пояснює веселку? 1. Дифракція; 2. Поляризація; 3. Заломлення світла: ')
        if q21 == '3':
            print('Правильна відповідь.')
            points += 1
        else :
            print('Невірна відповідь')
        q31 = input('Що таке інерція? 1. Здатність тіла змінювати швидкість; 2. Здатність тіла зберігати стан спокою або рівномірного руху'
                    '; 3. Опір руху рідини: ')
        if q31 == '2':
            print('Правильна відповідь.')
            points += 1
        else :
            print('Невірна відповідь')
        q41 = input('Як змінюється кінетична енергія тіла? 1.Зі збільшенням маси тіла зменшується ; 2. Зі збільшенням швидкості тіла зростає; '
                    '3. Не зімнюється: ')
        if q41 == '2':
            print('Правильна відповідь.')
            points += 1
        else:
            print('Невірна відповідь')
        q51 = input('Що вимірює амперметр? 1. Силу тиска; 2. Силу струму; 3. Силу тяжіння: ')
        if q51 == '2':
            print('Правильна відповідь.')
            points += 1
        else :
            print('Невірна відповідь')
        print('Ти набрав(ла)', points ,' з 5')
    elif diff1 == '2' :
        points = 0
        print(' Гаразд! Ось запитання.')
        q11 = input('Яка одиниця вимірювання сили в СІ? 1. Паскаль; 2. Ньютон; 3. Джоуль: ')
        if q11 == '2':
            print('Правильна відповідь.')
            points += 1
        else:
            print('Невірна відповідь')
        q21 = input('Яке явище пояснює веселку? 1. Дифракція; 2. Поляризація; 3. Заломлення світла: ')
        if q21 == '3':
            print('Правильна відповідь.')
            points += 1
        else:
            print('Невірна відповідь')
        q31 = input(
        'Що таке інерція? 1. Здатність тіла змінювати швидкість; 2. Здатність тіла зберігати стан спокою або рівномірного руху'
        '; 3. Опір руху рідини: ')
        if q31 == '2':
            print('Правильна відповідь.')
            points += 1
        else:
            print('Невірна відповідь')
        q41 = input(
        'Як змінюється кінетична енергія тіла? 1.Зі збільшенням маси тіла зменшується ; 2. Зі збільшенням швидкості тіла зростає; '
        '3. Не зімнюється: ')
        if q41 == '2':
            print('Правильна відповідь.')
            points += 1
        else:
            print('Невірна відповідь')
        q51 = input('Що вимірює амперметр? 1. Силу тиска; 2. Силу струму; 3. Силу тяжіння: ')
        if q51 == '2':
            print('Правильна відповідь.')
            points += 1
        else:
            print('Невірна відповідь')
        q61 = input('Як називається прилад для вимірювання температури? 1. Барометр; 2. Амперметр; 3. Термометр: ')
        if q61 == '3':
            print('Правильна відповідь.')
            points += 1
        else:
            print('Невірна відповідь')
        q71 = input('Що є джерелом електричного струму? 1. Резистор; 2. Генератор; 3. Провідник: ')
        if q71 == '2':
            print('Правильна відповідь.')
            points += 1
        else:
            print('Невірна відповідь')
        q81 = input('Який вид енергії зберігається в піднятій книзі? 1. Потенціальна; 2. Кінетична; 3. Теплова: ')
        if q81 == '1':
            print('Правильна відповідь.')
            points += 1
        else:
            print('Невірна відповідь')
        q91 = input('Як зміниться тиск, якщо площу збільшити вдвічі? 1. Зменшиться вдвічі; 2. Не зміниться; 3. Збільшиться вдвічі: ')
        if q91 == '3':
            print('Правильна відповідь.')
            points += 1
        else:
            print('Невірна відповідь')
        q101 = input('Який агрегатний стан має вода при температурі 0.С? 1. Рідкий; 2. Газоподібний; 3. Твердий: ')
        if q101 == '3':
            print('Правильна відповідь.')
            points += 1
        else:
            print('Невірна відповідь')
        print('Ти набрав(ла)', points, ' з 10')
    elif diff1 == '3' :
        points = 0
        print(' Гаразд! Ось запитання.')
        q11 = input('Яка одиниця вимірювання сили в СІ? 1. Паскаль; 2. Ньютон; 3. Джоуль: ')
        if q11 == '2':
            print('Правильна відповідь.')
            points += 1
        else:
            print('Невірна відповідь')
        q21 = input('Яке явище пояснює веселку? 1. Дифракція; 2. Поляризація; 3. Заломлення світла: ')
        if q21 == '3':
            print('Правильна відповідь.')
            points += 1
        else:
            print('Невірна відповідь')
        q31 = input(
            'Що таке інерція? 1. Здатність тіла змінювати швидкість; 2. Здатність тіла зберігати стан спокою або рівномірного руху'
            '; 3. Опір руху рідини: ')
        if q31 == '2':
            print('Правильна відповідь.')
            points += 1
        else:
            print('Невірна відповідь')
        q41 = input(
            'Як змінюється кінетична енергія тіла? 1.Зі збільшенням маси тіла зменшується ; 2. Зі збільшенням швидкості тіла зростає; '
            '3. Не зімнюється: ')
        if q41 == '2':
            print('Правильна відповідь.')
            points += 1
        else:
            print('Невірна відповідь')
        q51 = input('Що вимірює амперметр? 1. Силу тиска; 2. Силу струму; 3. Силу тяжіння: ')
        if q51 == '2':
            print('Правильна відповідь.')
            points += 1
        else:
            print('Невірна відповідь')
        q61 = input('Як називається прилад для вимірювання температури? 1. Барометр; 2. Амперметр; 3. Термометр: ')
        if q61 == '3':
            print('Правильна відповідь.')
            points += 1
        else:
            print('Невірна відповідь')
        q71 = input('Що є джерелом електричного струму? 1. Резистор; 2. Генератор; 3. Провідник: ')
        if q71 == '2':
            print('Правильна відповідь.')
            points += 1
        else:
            print('Невірна відповідь')
        q81 = input('Який вид енергії зберігається в піднятій книзі? 1. Потенціальна; 2. Кінетична; 3. Теплова: ')
        if q81 == '1':
            print('Правильна відповідь.')
            points += 1
        else:
            print('Невірна відповідь')
        q91 = input(
            'Як зміниться тиск, якщо площу збільшити вдвічі? 1. Зменшиться вдвічі; 2. Не зміниться; 3. Збільшиться вдвічі: ')
        if q91 == '3':
            print('Правильна відповідь.')
            points += 1
        else:
            print('Невірна відповідь')
        q101 = input('Який агрегатний стан має вода при температурі 0.С? 1. Рідкий; 2. Газоподібний; 3. Твердий: ')
        if q101 == '3':
            print('Правильна відповідь.')
            points += 1
        else:
            print('Невірна відповідь')
        q111 = input('Скільки дорівнює g? 1.90 км/с; 2. 9,8 м/с2; 3. 9,8 м/с: ')
        if q111 == '2' :
            print('Правильна відповідь')
        else :
            print('Невірна відповідь')
        q121 = input('Яке світло розкладається на спектр у призмі? 1. Біле; 2. Червоне; 3. Синє: ')
        if q121 == '1':
            print('Правильна відповідь')
        else:
            print('Невірна відповідь')
        q131 = input('Яке тіло вважається інертним? 1. Тіло, що не має масу; 2. Тіло, що має маленьку масу; 3. Тіло, що має велику масу: ')
        if q131 == '3':
            print('Правильна відповідь')
        else:
            print('Невірна відповідь')
        q141 = input('Що вимірюється в Омах? 1. Сила; 2. Опір; 3. Пружність: ')
        if q141 == '2':
            print('Правильна відповідь')
        else:
            print('Невірна відповідь')
        q151 = input('Що є наслідком третього закону Ньютона? 1. Пара рівних і протилежно спрямованих сил; 2. Нічого; '
                     '3. Сила тертя: ')
        if q151 == '1':
            print('Правильна відповідь')
        else:
            print('Невірна відповідь')
        print('Ти набрав(ла)', points, ' з 15')
    else :
        print('Вибери правильну важкість')
elif theme == '2' :
    diff2 = input('Чудово! Вибери важкість. 1 - легка; 2 - середня; 3 - важка: ')
    if diff2 == '1' :
        print(' Гаразд! Ось запитання.')
        points = 0
        q12 = input('Скільки буде 25*40? 1. 100; 2. 1000; 3. 500: ')
        if q12 == '2':
            print('Правильна відповідь.')
            points += 1
        else:
            print('Невірна відповідь')
        q22 = input('10х-7х - це? 1. Многочлен; 2. Рівняння; 3. Одночлен: ')
        if q22 == '3':
            print('Правильна відповідь.')
            points += 1
        else:
            print('Невірна відповідь')
        q32 = input('х-у - це? 1. Многочлен; 2. Рівняння; 3. Одночлен: ')
        if q32 == '1':
            print('Правильна відповідь.')
            points += 1
        else:
            print('Невірна відповідь')
        q42 = input('4х+9у=72 - це? 1.Многочлен; 2. Рівняння; 3. Одночлен: ')
        if q42 == '2':
            print('Правильна відповідь.')
            points += 1
        else:
            print('Невірна відповідь')
        q52 = input('Яке із чисел є простим? 1. 15; 2. 11; 3. 21: ')
        if q52 == '2':
            print('Правильна відповідь.')
            points += 1
        else:
            print('Невірна відповідь')
        print('Ти набрав(ла)', points, ' з 5')
    elif diff2 == '2':
        points = 0
        print(' Гаразд! Ось запитання.')
        q12 = input('Скільки буде 25*40? 1. 100; 2. 1000; 3. 500: ')
        if q12 == '2':
            print('Правильна відповідь.')
            points += 1
        else:
            print('Невірна відповідь')
        q22 = input('10х-7х - це? 1. Многочлен; 2. Рівняння; 3. Одночлен: ')
        if q22 == '3':
            print('Правильна відповідь.')
            points += 1
        else:
            print('Невірна відповідь')
        q32 = input('х-у - це? 1. Многочлен; 2. Рівняння; 3. Одночлен: ')
        if q32 == '1':
            print('Правильна відповідь.')
            points += 1
        else:
            print('Невірна відповідь')
        q42 = input('4х+9у=72 - це? 1. Многочлен; 2. Рівняння; 3. Одночлен: ')
        if q42 == '2':
            print('Правильна відповідь.')
            points += 1
        else:
            print('Невірна відповідь')
        q52 = input('Яке із чисел є простим? 1. 15; 2. 11; 3. 21: ')
        if q52 == '2':
            print('Правильна відповідь.')
            points += 1
        else:
            print('Невірна відповідь')
        q62 = input('Скільки розв\'язків має це рівняння: 2х+5=2х-3? 1. Безліч; 2. Один; 3. Жодного: ')
        if q62 == '3':
            print('Правильна відповідь.')
            points += 1
        else:
            print('Невірна відповідь')
            q72 = input('Скільки секунд у 2,5 годин? 1. 9000; 2. 8400; 3. 6000: ')
        if q72 == '1':
            print('Правильна відповідь.')
            points += 1
        else:
            print('Невірна відповідь')
        q82 = input('Корінь з якого числа дорівнює 15? 1. 225; 2. 215; 3. 125: ')
        if q82 == '1':
            print('Правильна відповідь.')
            points += 1
        else:
            print('Невірна відповідь')
        q92 = input('Яке число є НСК для 6 і 8? 1. 48; 2. 12; 3. 24: ')
        if q92 == '3':
            print('Правильна відповідь.')
            points += 1
        else:
            print('Невірна відповідь')
        q102 = input('Що більше 3/4 чи 0,7? 1. 0, 7; 2. Вони рівні; 3. 3/4: ')
        if q102 == '3':
            print('Правильна відповідь.')
            points += 1
        else:
            print('Невірна відповідь')
        print('Ти набрав(ла)', points, ' з 10')
    elif diff2 == '3' :
        points = 0
        print(' Гаразд! Ось запитання.')
        q12 = input('Скільки буде 25*40? 1. 100; 2. 1000; 3. 500: ')
        if q12 == '2':
            print('Правильна відповідь.')
            points += 1
        else:
            print('Невірна відповідь')
        q22 = input('10х-7х - це? 1. Многочлен; 2. Рівняння; 3. Одночлен: ')
        if q22 == '3':
            print('Правильна відповідь.')
            points += 1
        else:
            print('Невірна відповідь')
        q32 = input('х-у - це? 1. Многочлен; 2. Рівняння; 3. Одночлен: ')
        if q32 == '1':
            print('Правильна відповідь.')
            points += 1
        else:
            print('Невірна відповідь')
        q42 = input('4х+9у=72 - це? 1. Многочлен; 2. Рівняння; 3. Одночлен: ')
        if q42 == '2':
            print('Правильна відповідь.')
            points += 1
        else:
            print('Невірна відповідь')
        q52 = input('Яке із чисел є простим? 1. 15; 2. 11; 3. 21: ')
        if q52 == '2':
            print('Правильна відповідь.')
            points += 1
        else:
            print('Невірна відповідь')
        q62 = input('Скільки розв\'язків має це рівняння: 2х+5=2х-3? 1. Безліч; 2. Один; 3. Жодного: ')
        if q62 == '3':
            print('Правильна відповідь.')
            points += 1
        else:
            print('Невірна відповідь')
        q72 = input('Скільки секунд у 2,5 годин? 1. 9000; 2. 8400; 3. 6000: ')
        if q72 == '1':
            print('Правильна відповідь.')
            points += 1
        else:
            print('Невірна відповідь')
        q82 = input('Корінь з якого числа дорівнює 15? 1. 225; 2. 215; 3. 125: ')
        if q82 == '1':
            print('Правильна відповідь.')
            points += 1
        else:
            print('Невірна відповідь')
        q92 = input('Яке число є НСК для 6 і 8? 1. 48; 2. 12; 3. 24: ')
        if q92 == '3':
            print('Правильна відповідь.')
            points += 1
        else:
            print('Невірна відповідь')
        q102 = input('Що більше 3/4 чи 0,7? 1. 0, 7; 2. Вони рівні; 3. 3/4: ')
        if q102 == '3':
            print('Правильна відповідь.')
            points += 1
        else:
            print('Невірна відповідь')
        q112 = input('Який об\'єм має куб зі стороною 5 см? 1. 125 см; 2. 125 см2; 3. 125 см3: ')
        if q112 == '3':
            print('Правильна відповідь.')
            points += 1
        else:
            print('Невірна відповідь')
        q122 = input('Яке з чисел є квадратом парного числа? 1. 49; 2. 36; 3. 25: ')
        if q122 == '2':
            print('Правильна відповідь.')
            points += 1
        else:
            print('Невірна відповідь')
        q132 = input('В якому випадку паралельні прямі можут перетнутися? 1. Такого не може бути; 2. Коли вони на одній площині; '
                     '3. Коли вони на різних площинах: ')
        if q132 == '3':
            print('Правильна відповідь.')
            points += 1
        else:
            print('Невірна відповідь')
        q142 = input('Чому дорівнює середнє арефметичне цих чисел: 12; 4; 27? 1. ~ 14,3; 2. ~14,6; 3. 12: ')
        if q142 == '1':
            print('Правильна відповідь.')
            points += 1
        else:
            print('Невірна відповідь')
        q152 = input('Через скільки взірветься кріпер, якщо підійти до нього? 1. 1,5 с; 2. 1 с; 3.0,5 с: ')
        if q152 == '1':
            print('Правильна відповідь.')
            points += 1
        else:
            print('Невірна відповідь')
        print('Ти набрав(ла)', points, 'з 15')
    else :
        print('Вибери правильну важкість')
elif theme == '3' :
    diff3 = input('Чудово! Вибери важкість. 1 - легка; 2 - середня; 3 - важка: ')
    if diff3 == '1' :
        print(' Гаразд! Ось запитання.')
        points = 0
        q13 = input('Як називається точка де простір-час втрачають сенс у чорній дирі? 1. Горизонт подій; 2. Сингулярність; '
                    '3. Квантова флуктація: ')
        if q13 == '2':
            print('Правильна відповідь.')
            points += 1
        else:
            print('Невірна відповідь')
        q23 = input('Що таке червоне зміщення в спектрі далекої галактики? 1. Дифракція; 2. Свідчення розширення всесвіту'
                    '; 3. Гамма випромінювання: ')
        if q23 == '2':
            print('Правильна відповідь.')
            points += 1
        else:
            print('Невірна відповідь')
        q33 = input('Скільки триває світловий рік у днях? 1. 365; 2. 10000'
        '; 3. Ніскільки, це відстань: ')
        if q33 == '3':
            print('Правильна відповідь.')
            points += 1
        else:
            print('Невірна відповідь')
        q43 = input(
        'Як називається рівняння, яке описує розширення Всесвіту? 1. Рівняння Енштейна ; '
        '2. Рівняння Габбла; '
        '3. Рівняння Шредінгіра: ')
        if q43 == '2':
            print('Правильна відповідь.')
            points += 1
        else:
            print('Невірна відповідь')
        q53 = input('Який тип зорі закінчує життя, як наднова? 1. Масивна зоря; 2. Карликова зоря; 3. Люба зоря: ')
        if q53 == '1':
            print('Правильна відповідь.')
            points += 1
        else:
            print('Невірна відповідь')
            print('Ти набрав(ла)', points, ' з 5')
    elif diff3 == '2':
        points = 0
        print(' Гаразд! Ось запитання.')
        q13 = input('Як називається точка де простір-час втрачають сенс у чорній дирі? 1. Горизонт подій; 2. Сингулярність;'
                    ' 3. Квантова флуктація: ')
        if q13 == '2':
            print('Правильна відповідь.')
            points += 1
        else:
            print('Невірна відповідь')
        q23 = input('Що таке червоне зміщення в спектрі далекої галактики? 1. Дифракція; 2. Свідчення про розширення Всесвіта; '
                    '3. Гамма випромінювання: ')
        if q23 == '2':
            print('Правильна відповідь.')
            points += 1
        else:
            print('Невірна відповідь')
        q33 = input('Скільки триває світловий рік у днях? 1. 365; 2. 1000'
        '; 3. Ніскільки, це відстань: ')
        if q33 == '3':
            print('Правильна відповідь.')
            points += 1
        else:
            print('Невірна відповідь')
        q43 = input('Як називається рівняння, яке описує розширення Всесвіта; 1. Рівняння Ейнштейна '
            '2. Рівняння Габбла ; '
            '3. Рівняння Шредінгіра: ')
        if q43 == '2':
            print('Правильна відповідь.')
            points += 1
        else:
            print('Невірна відповідь')
        q53 = input('Який вид зорі закінчує життя, як наднова? 1. Масивна зоря; 2. Карликова зоря; 3. Люба зоря: ')
        if q53 == '1':
            print('Правильна відповідь.')
            points += 1
        else:
            print('Невірна відповідь')
        q63 = input('Що таке нейтронна зоря? 1. Газова хмара; 2. Карликова зоря; 3. Залишок наднової: ')
        if q63 == '3':
            print('Правильна відповідь.')
            points += 1
        else:
            print('Невірна відповідь')
        q73 = input('Що таке темна матерія? 1. Частинки з від\'ємною масою; 2. Антиречовина; '
                    '3. Невидима маса, що впливає на гравітацію: ')
        if q73 == '3':
            print('Правильна відповідь.')
            points += 1
        else:
            print('Невірна відповідь')
        q83 = input('Який тип спектра має розжарене тверде тіло? 1. Суцільний; 2. Лінійчатий; 3. Хвильовий: ')
        if q83 == '1':
            print('Правильна відповідь.')
            points += 1
        else:
            print('Невірна відповідь')
        q93 = input('Що таке фонова мікрохвильова радіація? 1.Радіохвилі від Сонця; 2. Сліди Великого Вибуху; '
                    '3. Порушення в телескопі: ')
        if q93 == '2':
            print('Правильна відповідь.')
            points += 1
        else:
            print('Невірна відповідь')
        q103 = input('Що таке епоха рекомбінації? 1. Перші роки Великого вибуху; 2. Коли плазма почала остигати; '
                     '3. Коли утворилася перша чорна діра: ')
        if q103 == '2':
            print('Правильна відповідь.')
            points += 1
        else:
            print('Невірна відповідь')
        print('Ти набрав(ла)', points, ' з 10')
    elif diff3 == '3':
        points = 0
        print(' Гаразд! Ось запитання.')
        q13 = input('Як називається точка де простір-час втрачають сенс у чорній дирі? 1. Горизонт подій; 2. Сингулярність;'
                ' 3. Квантова флуктація: ')
        if q13 == '2':
            print('Правильна відповідь.')
            points += 1
        else:
            print('Невірна відповідь')
        q23 = input(
            'Що таке червоне зміщення в спектрі далекої галактики? 1. Дифракція; 2. Свідчення про розширення Всесвіта; '
            '3. Гамма випромінювання: ')
        if q23 == '2':
            print('Правильна відповідь.')
            points += 1
        else:
            print('Невірна відповідь')
        q33 = input('Скільки триває світловий рік у днях? 1. 365; 2. 1000'
                '; 3. Ніскільки, це відстань: ')
        if q33 == '3':
            print('Правильна відповідь.')
            points += 1
        else:
            print('Невірна відповідь')
        q43 = input('Як називається рівняння, яке описує розширення Всесвіта; 1. Рівняння Ейнштейна '
                    '2. Рівняння Габбла ; '
                    '3. Рівняння Шредінгіра: ')
        if q43 == '2':
            print('Правильна відповідь.')
            points += 1
        else:
            print('Невірна відповідь')
        q53 = input('Який вид зорі закінчує життя, як наднова? 1. Масивна зоря; 2. Карликова зоря; 3. Люба зоря: ')
        if q53 == '1':
            print('Правильна відповідь.')
            points += 1
        else:
            print('Невірна відповідь')
        q63 = input('Що таке нейтронна зоря? 1. Газова хмара; 2. Карликова зоря; 3. Залишок наднової: ')
        if q63 == '3':
            print('Правильна відповідь.')
            points += 1
        else:
            print('Невірна відповідь')
        q73 = input('Що таке темна матерія? 1. Частинки з від\'ємною масою; 2. Антиречовина; '
                '3. Невидима маса, що впливає на гравітацію: ')
        if q73 == '3':
            print('Правильна відповідь.')
            points += 1
        else:
            print('Невірна відповідь')
        q83 = input('Який тип спектра має розжарене тверде тіло? 1. Суцільний; 2. Лінійчатий; 3. Хвильовий: ')
        if q83 == '1':
            print('Правильна відповідь.')
            points += 1
        else:
            print('Невірна відповідь')
        q93 = input('Що таке фонова мікрохвильова радіація? 1.Радіохвилі від Сонця; 2. Сліди Великого Вибуху; '
                    '3. Порушення в телескопі: ')
        if q93 == '2':
            print('Правильна відповідь.')
            points += 1
        else:
            print('Невірна відповідь')
        q103 = input('Що таке епоха рекомбінації? 1. Перші роки Великого вибуху; 2. Коли плазма почала остигати; '
                    '3. Коли утворилася перша чорна діра: ')
        if q103 == '2':
            print('Правильна відповідь.')
            points += 1
        else:
            print('Невірна відповідь')
        q113 = input('Який механізм живить світіння зір? 1. Хімічне горіння; 2. Тертя у плазмі; '
                     '3. Термоядерні реакції: ')
        if q113 == '3':
            print('Правильна відповідь.')
            points += 1
        else:
            print('Невірна відповідь')
        q123 = input('Яку форму має Всесвіт? 1. Плоску; 2. Замкнуту; '
                     '3. Відкриту: ')
        if q123 == '1':
            print('Правильна відповідь.')
            points += 1
        else:
            print('Невірна відповідь')
        q133 = input('Якої аберації не існує? 1. Кома; 2. Плазматична; '
                     '3. Хроматична: ')
        if q133 == '2':
            print('Правильна відповідь.')
            points += 1
        else:
            print('Невірна відповідь')
        q143 = input('Який був перший атом? 1. Нейтральний гелій; 2. Нейтральний гідроген; '
                     '3. Нейтральний оксиген: ')
        if q143 == '2':
            print('Правильна відповідь.')
            points += 1
        else:
            print('Невірна відповідь')
        q153 = input('Скільки % займає темна матерія у Всесвіті? 1. 27%; 2. 71%; '
                     '3. Невідомо: ')
        if q153 == '1':
            print('Правильна відповідь.')
            points += 1
        else:
            print('Невірна відповідь')
        print('Ти набрав(ла)', points, ' з 15')
    else :
        print('Вибери правильну важкість')
elif theme == '4' :
    diff4 = input('Чудово! Вибери важкість. 1 - легка; 2 - середня; 3 - важка: ')
    if diff4 == '1' :
        print(' Гаразд! Ось запитання.')
        points = 0
        q14 = input('Який орган здійснює синтез білка в клітині? 1. Мітохондрія; 2. Рибосома; 3. Лізосома: ')
        if q14 == '2':
            print('Правильна відповідь.')
            points += 1
        else:
            print('Невірна відповідь')
        q24 = input('Яка тканина транспортує воду у клітини? 1. Флоема; 2. Камбій; 3. Кселема: ')
        if q24 == '3':
            print('Правильна відповідь.')
            points += 1
        else:
            print('Невірна відповідь')
        q34 = input(
            'Яка спадкова одиниця передає ознаки від батьків до нащадків? 1. Ген; 2. Хромосома'
            '; 3. ДНК: ')
        if q34 == '1':
            print('Правильна відповідь.')
            points += 1
        else:
            print('Невірна відповідь')
        q44 = input(
            'Який процес відбувається під час фотосинтезу? 1. Вивільнення енергії з глюкози; 2. Поглинання кисню; '
            '3. Утворення вуглекислого газу: ')
        if q44 == '3':
            print('Правильна відповідь.')
            points += 1
        else:
            print('Невірна відповідь')
        q54 = input('Який орган людини відповідає за вироблення інсуліну? 1. Печінка; 2. Підшлункова залоза; 3. Нирки: ')
        if q54 == '2':
            print('Правильна відповідь.')
            points += 1
        else:
            print('Невірна відповідь')
            print('Ти набрав(ла)', points, ' з 5')
    elif diff4 == '2':
        points = 0
        print(' Гаразд! Ось запитання.')
        q14 = input('Який орган здійснює синтез білка в клітині? 1. Мітохондрія; 2. Рибосома; 3. Лізосома: ')
        if q14 == '2':
            print('Правильна відповідь.')
            points += 1
        else:
            print('Невірна відповідь')
        q24 = input('Яка тканина транспортує воду у клітини? 1. Флоема; 2. Камбій; 3. Кселема: ')
        if q24 == '3':
            print('Правильна відповідь.')
            points += 1
        else:
            print('Невірна відповідь')
        q34 = input(
            'Яка спадкова одиниця передає ознаки від батьків до нащадків? 1. Ген; 2. Хромосома'
            '; 3. ДНК: ')
        if q34 == '2':
            print('Правильна відповідь.')
            points += 1
        else:
            print('Невірна відповідь')
        q44 = input(
            'Який процес відбувається під час фотосинтезу? 1. Вивільнення енергії з глюкози; 2. Поглинання кисню; '
            '3. Утворення вуглекислого газу: ')
        if q44 == '3':
            print('Правильна відповідь.')
            points += 1
        else:
            print('Невірна відповідь')
        q54 = input('Який орган людини відповідає за вироблення інсуліну? 1. Печінка; 2. Підшлункова залоза; 3. Нирки: ')
        if q54 == '2':
            print('Правильна відповідь.')
            points += 1
        else:
            print('Невірна відповідь')
        q64 = input('Який тип розмноження не передбачає участі статевих клітин? 1. Статеве; 2. Перехресне; 3. Брунькування')
        if q64 == '3':
            print('Правильна відповідь.')
            points += 1
        else:
            print('Невірна відповідь')
            q74 = input('Скільки хромосом у людини? 1. 46; 2. 42; 3. 47: ')
        if q74 == '1':
            print('Правильна відповідь.')
            points += 1
        else:
            print('Невірна відповідь')
        q84 = input('Як називається період подвоєння ДНК у клітин? 1. Інтерфаза; 2. Анафаза; 3. Телофаза: ')
        if q84 == '1':
            print('Правильна відповідь.')
            points += 1
        else:
            print('Невірна відповідь')
        q94 = input(
            'Яка система організму відповідає за захист від інфекцій? 1. Видільна; 2. Нервова; 3. Імунна: ')
        if q94 == '3':
            print('Правильна відповідь.')
            points += 1
        else:
            print('Невірна відповідь')
        q104 = input('Який вид відносин між організмами є взаємовигідним? 1. Хижацтво; 2. Паразитизм; 3. Симбіоз: ')
        if q104 == '3':
            print('Правильна відповідь.')
            points += 1
        else:
            print('Невірна відповідь')
        print('Ти набрав(ла)', points, ' з 10')
    elif diff4 == '3':
        points = 0
        print(' Гаразд! Ось запитання.')
        q14 = input('Який орган здійснює синтез білка в клітині? 1. Мітохондрія; 2. Рибосома; 3. Лізосома: ')
        if q14 == '2':
            print('Правильна відповідь.')
            points += 1
        else:
            print('Невірна відповідь')
        q24 = input('Яка тканина транспортує воду у клітини? 1. Флоема; 2. Камбій; 3. Кселема: ')
        if q24 == '3':
            print('Правильна відповідь.')
            points += 1
        else:
            print('Невірна відповідь')
        q34 = input(
            'Яка спадкова одиниця передає ознаки від батьків до нащадків? 1. Ген; 2. Хромосома'
            '; 3. ДНК: ')
        if q34 == '2':
            print('Правильна відповідь.')
            points += 1
        else:
            print('Невірна відповідь')
        q44 = input(
            'Який процес відбувається під час фотосинтезу? 1. Вивільнення енергії з глюкози; 2. Поглинання кисню; '
            '3. Утворення вуглекислого газу: ')
        if q44 == '3':
            print('Правильна відповідь.')
            points += 1
        else:
            print('Невірна відповідь')
        q54 = input('Який орган людини відповідає за вироблення інсуліну? 1. Печінка; 2. Підшлункова залоза; 3. Нирки: ')
        if q54 == '2':
            print('Правильна відповідь.')
            points += 1
        else:
            print('Невірна відповідь')
        q64 = input('Який тип розмноження не передбачає участі статевих клітин? 1. Статеве; 2. Перехресне; 3. Брунькування')
        if q64 == '3':
            print('Правильна відповідь.')
            points += 1
        else:
            print('Невірна відповідь')
            q74 = input('Скільки хромосом у людини? 1. 46; 2. 42; 3. 47: ')
        if q74 == '1':
            print('Правильна відповідь.')
            points += 1
        else:
            print('Невірна відповідь')
        q84 = input('Як називається період подвоєння ДНК у клітин? 1. Інтерфаза; 2. Анафаза; 3. Телофаза: ')
        if q84 == '1':
            print('Правильна відповідь.')
            points += 1
        else:
            print('Невірна відповідь')
        q94 = input(
            'Яка система організму відповідає за захист від інфекцій? 1. Видільна; 2. Нервова; 3. Імунна: ')
        if q94 == '3':
            print('Правильна відповідь.')
            points += 1
        else:
            print('Невірна відповідь')
        q104 = input('Який вид відносин між організмами є взаємовигідним? 1. Хижацтво; 2. Паразитизм; 3. Симбіоз: ')
        if q104 == '3':
            print('Правильна відповідь.')
            points += 1
        else:
            print('Невірна відповідь')
        q114 = input('Який біологічний процес є основою революції за Дарвіном? 1. Мутації; 2. Природний добір; '
                     '3. Штучний добір: ')
        if q114 == '2':
            print('Правильна відповідь.')
            points += 1
        else:
            print('Невірна відповідь')
        q124 = input('Який орган кровообігу фільтрує старі еритроцити? 1. Печінка; 2. Селезінка; 3. Нирки: ')
        if q124 == '2':
            print('Правильна відповідь.')
            points += 1
        else:
            print('Невірна відповідь')
        q134 = input('Яка частинка нейрона передає імпульс до інших клітин? 1. Аксон; 2. Синапс; 3. Дендрит: ')
        if q134 == '1':
            print('Правильна відповідь.')
            points += 1
        else:
            print('Невірна відповідь')
        q144 = input('Який фрагмент розщеплює крохмаль у ротовій поржнині? 1. Пепсин; 2. Ліпаза; 3. Амілаза: ')
        if q144 == '3':
            print('Правильна відповідь.')
            points += 1
        else:
            print('Невірна відповідь')
        q154 = input('Яка тварина гавкає? 1. Кінь; 2. Кіт; 3. Вчителька з біології: ')
        if q154 == '3':
            print('Правильна відповідь.')
            points += 1
        else:
            print('Невірна відповідь')
        print('Ти набрав(ла)', points, ' з 15')
    else :
        print('Вибери правильну важкість')
elif theme == '5' :
    diff5 = input('Чудово! Вибери важкість. 1 - легка; 2 - середня; 3 - важка: ')
    if diff5 == '1' :
        print(' Гаразд! Ось запитання.')
        points = 0
        q15 = input('Який елемент є металом? 1. Сірка; 2. Натрій; 3. Кисень: ')
        if q15 == '2':
            print('Правильна відповідь.')
            points += 1
        else:
            print('Невірна відповідь')
        q25 = input('Який оксид утворює кислоту при взаємодії з водою? 1. CaO; 2. MgO; 3. SO3: ')
        if q25 == '3':
            print('Правильна відповідь.')
            points += 1
        else:
            print('Невірна відповідь')
        q35 = input(
            'Яка формула гідроксиду кальцію? 1. CaOH; 2. Ca(OH)2'
            '; 3. Ca2OH: ')
        if q35 == '2':
            print('Правильна відповідь.')
            points += 1
        else:
            print('Невірна відповідь')
        q45 = input(
            'Що є продуктами реакції нейтралізації кислоти з основою? 1.Оксид і вода ; 2. Сіль і кисень; '
            '3. Сіль і вода: ')
        if q45 == '3':
            print('Правильна відповідь.')
            points += 1
        else:
            print('Невірна відповідь')
        q55 = input('Який газ виділяється при реакції кислоти з металом? 1. Кисень; 2. Водень; 3. Азот: ')
        if q55 == '2':
            print('Правильна відповідь.')
            points += 1
        else:
            print('Невірна відповідь')
            print('Ти набрав(ла)', points, ' з 5')
    elif diff5 == '2':
        points = 0
        print(' Гаразд! Ось запитання.')
        q15 = input('Який елемент є металом? 1. Сірка; 2. Натрій; 3. Кисень: ')
        if q15 == '2':
            print('Правильна відповідь.')
            points += 1
        else:
            print('Невірна відповідь')
        q25 = input('Який оксид утворює кислоту при взаємодії з водою? 1. CaO; 2. MgO; 3. SO3: ')
        if q25 == '3':
            print('Правильна відповідь.')
            points += 1
        else:
            print('Невірна відповідь')
        q35 = input(
            'Яка формула гідроксиду кальцію? 1. CaOH; 2. Ca(OH)2'
            '; 3. Ca2OH: ')
        if q35 == '2':
            print('Правильна відповідь.')
            points += 1
        else:
            print('Невірна відповідь')
        q45 = input(
            'Що є продуктами реакції нейтралізації кислоти з основою? 1.Оксид і вода ; 2. Сіль і кисень; '
            '3. Сіль і вода: ')
        if q45 == '3':
            print('Правильна відповідь.')
            points += 1
        else:
            print('Невірна відповідь')
        q55 = input('Який газ виділяється при реакції кислоти з металом? 1. Кисень; 2. Водень; 3. Азот: ')
        if q55 == '2':
            print('Правильна відповідь.')
            points += 1
        else:
            print('Невірна відповідь')
        q65 = input('Який елемент має найбільшу електронегативність? 1. Флуор; 2. Хлор; 3. Камінь: ')
        if q65 == '1':
            print('Правильна відповідь.')
            points += 1
        else:
            print('Невірна відповідь')
        q75 = input('Що проводить електричний струм? 1. Глюкоза; 2. Дистильовона вода; 3. NACl у воді: ')
        if q75 == '3':
            print('Правильна відповідь.')
            points += 1
        else:
            print('Невірна відповідь')
        q85 = input('Яка з речовин є вуглеводом? 1. C2H6; 2. CH3OH; 3. CO2: ')
        if q85 == '1':
            print('Правильна відповідь.')
            points += 1
        else:
            print('Невірна відповідь')
        q95 = input(
            'Яка маса одного моля води? 1. 16 г; 2. 20 г; 3. 18 г: ')
        if q95 == '3':
            print('Правильна відповідь.')
            points += 1
        else:
            print('Невірна відповідь')
        q105 = input('Який продукт утворюється при повному згорянні метану? 1. CO i H2; 2. CH3OH; 3. CO2 i H2O: ')
        if q105 == '3':
            print('Правильна відповідь.')
            points += 1
        else:
            print('Невірна відповідь')
        print('Ти набрав(ла)', points, ' з 10')
    elif diff5 == '3':
        points = 0
        print(' Гаразд! Ось запитання.')
        q15 = input('Який елемент є металом? 1. Сірка; 2. Натрій; 3. Кисень: ')
        if q15 == '2':
            print('Правильна відповідь.')
            points += 1
        else:
            print('Невірна відповідь')
        q25 = input('Який оксид утворює кислоту при взаємодії з водою? 1. CaO; 2. MgO; 3. SO3: ')
        if q25 == '3':
            print('Правильна відповідь.')
            points += 1
        else:
            print('Невірна відповідь')
        q35 = input(
            'Яка формула гідроксиду кальцію? 1. CaOH; 2. Ca(OH)2'
            '; 3. Ca2OH: ')
        if q35 == '2':
            print('Правильна відповідь.')
            points += 1
        else:
            print('Невірна відповідь')
        q45 = input(
            'Що є продуктами реакції нейтралізації кислоти з основою? 1.Оксид і вода ; 2. Сіль і кисень; '
            '3. Сіль і вода: ')
        if q45 == '3':
            print('Правильна відповідь.')
            points += 1
        else:
            print('Невірна відповідь')
        q55 = input('Який газ виділяється при реакції кислоти з металом? 1. Кисень; 2. Водень; 3. Азот: ')
        if q55 == '2':
            print('Правильна відповідь.')
            points += 1
        else:
            print('Невірна відповідь')
        q65 = input('Який елемент має найбільшу електронегативність? 1. Флуор; 2. Хлор; 3. Камінь: ')
        if q65 == '1':
            print('Правильна відповідь.')
            points += 1
        else:
            print('Невірна відповідь')
        q75 = input('Що проводить електричний струм? 1. Глюкоза; 2. Дистильовона вода; 3. NACl у воді: ')
        if q75 == '3':
            print('Правильна відповідь.')
            points += 1
        else:
            print('Невірна відповідь')
        q85 = input('Яка з речовин є вуглеводом? 1. C2H6; 2. CH3OH; 3. CO2: ')
        if q85 == '1':
            print('Правильна відповідь.')
            points += 1
        else:
            print('Невірна відповідь')
        q95 = input(
            'Яка маса одного моля води? 1. 16 г; 2. 20 г; 3. 18 г: ')
        if q95 == '3':
            print('Правильна відповідь.')
            points += 1
        else:
            print('Невірна відповідь')
        q105 = input('Який продукт утворюється при повному згорянні метану? 1. CO i H2; 2. CH3OH; 3. CO2 i H2O: ')
        if q105 == '3':
            print('Правильна відповідь.')
            points += 1
        else:
            print('Невірна відповідь')
        q115 = input('Яка формула спирту? 1. C2H5OH ; 2. C3O2H; 3. C2H2O: ')
        if q115 == '1':
            print('Правильна відповідь.')
            points += 1
        else:
            print('Невірна відповідь')
        q125 = input('Яка речовина є основною? 1. HCl; 2. NaOH; 3. CO2: ')
        if q125 == '2':
            print('Правильна відповідь.')
            points += 1
        else:
            print('Невірна відповідь')
        q135 = input('Яка формула кухонної сілі? 1. HCl; 2. NaCl; 3. CaCl2: ')
        if q135 == '2':
            print('Правильна відповідь.')
            points += 1
        else:
            print('Невірна відповідь')
        q145 = input('Яка речовина може змінювати колір індикатора? 1. Сіль; 2. Вода; 3. Кислота: ')
        if q145 == '3':
            print('Правильна відповідь.')
            points += 1
        else:
            print('Невірна відповідь')
        q155 = input('Який з варіантів показує швидкість хімічки на контрольній? 1. Велика; 2. Дуже велика; '
                     '3. Більше швидкості світла: ')
        if q155 == '3':
            print('Правильна відповідь.')
            points += 1
        else:
            print('Невірна відповідь')
        print('Ти набрав(ла)', points, ' з 15')
    else :
        print('Вибери правильну важкість')
elif theme == '6' :
    print('Чудово! 1 - Тралалело тралала; 2 - Бобріто бандіто; 3 - тріпі тропі тропа тріпа.')
    answer = input('Ця тварина одна із найперших: ')
    if answer == '1' :
        print('Правильно! Кількість балів 5 з 5')
    else :
        answer = input('Ця тварина має дітей: ')
        if answer == '1' :
            print('Правильно! Кількість балів 4 з 5')
        else:
            answer = input('Ця тварина має свою пісню: ')
            if answer == '1':
                print('Правильно! Кількість балів 3 з 5')
            else:
                answer = input('Ця тварина змагалась з крокаділо бомбарділо: ')
                if answer == '1':
                    print('Правильно! Кількість балів 2 з 5')
                else:
                    answer = input('Ця тварина має одяг: ')
                    if answer == '1':
                        print('Правильно! Кількість балів 1 з 5')
                    else:
                        answer = input('Ця тварина багато бігає: ')
                        if answer == '1':
                            print('Правильно! Кількість балів 0,5 з 5')
                        else :
                            print('Неправильно. Кількість балів 0 з 5')
else :
    print('Неправильна тема')