print('Привіт! Це гра-вікторина. У тебе є на вибір 5 тем: фізика; математика; астрономія; біологія; хімія. '
      'Та 2 важкості: легка; важка. '
      'На кожну тему в залежності від важкості будуть запитання: 5 - легка;10 - важка. '
      'Тобі будуть давати 3 варіанти відповіді на кожне запитання')
theme = input('Вибери тему. 1 - фізика; 2 - математика; 3 - астрономія; 4 - біологія; 5 - хімія: ')
if theme == '1' :
    diff1 = input('Чудово! Вибери важкість. 1 - легка;2 - важка: ')
    if diff1 == '1' :
        points = 0
        print(' Гаразд! Ось запитання.')
        q11 = input('Яка одиниця вимірювання сили в СІ? 1. Паскаль; 2. Ньютон; 3. Джоуль: ')
        if q11 == '2' :
            print('Правильна відповідь.')
            points += 1
        else :
            print('Невірна відповідь')
        q21 = input('Яке явище пояснює веселку? 1. Дифракція; 2. Поляризація; 3. Заломлення світла: ')
        if q21 == '3':
            print('Правильна відповідь.')
            points += 1
        else :
            print('Невірна відповідь')
        q31 = input('Що таке інерція? 1. Здатність тіла змінювати швидкість; 2. Здатність тіла зберігати стан спокою або рівномірного руху'
                    '; 3. Опір руху рідини: ')
        if q31 == '2':
            print('Правильна відповідь.')
            points += 1
        else :
            print('Невірна відповідь')
        q41 = input('Як змінюється кінетична енергія тіла? 1.Зі збільшенням маси тіла зменшується ; 2. Зі збільшенням швидкості тіла зростає; '
                    '3. Не зімнюється: ')
        if q41 == '2':
            print('Правильна відповідь.')
            points += 1
        else:
            print('Невірна відповідь')
        q51 = input('Що вимірює амперметр? 1. Силу тиска; 2. Силу струму; 3. Силу тяжіння: ')
        if q51 == '2':
            print('Правильна відповідь.')
            points += 1
        else :
            print('Невірна відповідь')
        print('Ти набрав(ла)', points ,' з 5')
    elif diff1 == '2' :
        points = 0
        print(' Гаразд! Ось запитання.')
        q11 = input('Яка одиниця вимірювання сили в СІ? 1. Паскаль; 2. Ньютон; 3. Джоуль: ')
        if q11 == '2':
            print('Правильна відповідь.')
            points += 1
        else:
            print('Невірна відповідь')
        q21 = input('Яке явище пояснює веселку? 1. Дифракція; 2. Поляризація; 3. Заломлення світла: ')
        if q21 == '3':
            print('Правильна відповідь.')
            points += 1
        else:
            print('Невірна відповідь')
        q31 = input(
        'Що таке інерція? 1. Здатність тіла змінювати швидкість; 2. Здатність тіла зберігати стан спокою або рівномірного руху'
        '; 3. Опір руху рідини: ')
        if q31 == '2':
            print('Правильна відповідь.')
            points += 1
        else:
            print('Невірна відповідь')
        q41 = input(
        'Як змінюється кінетична енергія тіла? 1.Зі збільшенням маси тіла зменшується ; 2. Зі збільшенням швидкості тіла зростає; '
        '3. Не зімнюється: ')
        if q41 == '2':
            print('Правильна відповідь.')
            points += 1
        else:
            print('Невірна відповідь')
        q51 = input('Що вимірює амперметр? 1. Силу тиска; 2. Силу струму; 3. Силу тяжіння: ')
        if q51 == '2':
            print('Правильна відповідь.')
            points += 1
        else:
            print('Невірна відповідь')
        q61 = input('Як називається прилад для вимірювання температури? 1. Барометр; 2. Амперметр; 3. Термометр: ')
        if q61 == '3':
            print('Правильна відповідь.')
            points += 1
        else:
            print('Невірна відповідь')
        q71 = input('Що є джерелом електричного струму? 1. Резистор; 2. Генератор; 3. Провідник: ')
        if q71 == '2':
            print('Правильна відповідь.')
            points += 1
        else:
            print('Невірна відповідь')
        q81 = input('Який вид енергії зберігається в піднятій книзі? 1. Потенціальна; 2. Кінетична; 3. Теплова: ')
        if q81 == '1':
            print('Правильна відповідь.')
            points += 1
        else:
            print('Невірна відповідь')
        q91 = input('Як зміниться тиск, якщо площу збільшити вдвічі? 1. Зменшиться вдвічі; 2. Не зміниться; 3. Збільшиться вдвічі: ')
        if q91 == '3':
            print('Правильна відповідь.')
            points += 1
        else:
            print('Невірна відповідь')
        q101 = input('Який агрегатний стан має вода при температурі 0.С? 1. Рідкий; 2. Газоподібний; 3. Твердий: ')
        if q101 == '3':
            print('Правильна відповідь.')
            points += 1
        else:
            print('Невірна відповідь')
        print('Ти набрав(ла)', points, ' з 10')
elif theme == '2' :
    diff2 = input('Чудово! Вибери важкість. 1 - легка; 2 - важка: ')
    if diff2 == '1' :
        print(' Гаразд! Ось запитання.')
        points = 0
        q12 = input('Скільки буде 25*40? 1. 100; 2. 1000; 3. 500: ')
        if q12 == '2':
            print('Правильна відповідь.')
            points += 1
        else:
            print('Невірна відповідь')
        q22 = input('10х-7х - це? 1. Многочлен; 2. Рівняння; 3. Одночлен: ')
        if q22 == '3':
            print('Правильна відповідь.')
            points += 1
        else:
            print('Невірна відповідь')
        q32 = input('х-у - це? 1. Многочлен; 2. Рівняння; 3. Одночлен: ')
        if q32 == '1':
            print('Правильна відповідь.')
            points += 1
        else:
            print('Невірна відповідь')
        q42 = input('4х+9у=72 - це? 1.Многочлен; 2. Рівняння; 3. Одночлен: ')
        if q42 == '2':
            print('Правильна відповідь.')
            points += 1
        else:
            print('Невірна відповідь')
        q52 = input('Яке із чисел є простим? 1. 15; 2. 11; 3. 21: ')
        if q52 == '2':
            print('Правильна відповідь.')
            points += 1
        else:
            print('Невірна відповідь')
        print('Ти набрав(ла)', points, ' з 5')
    elif diff2 == '2':
        points = 0
        print(' Гаразд! Ось запитання.')
        q12 = input('Скільки буде 25*40? 1. 100; 2. 1000; 3. 500: ')
        if q12 == '2':
            print('Правильна відповідь.')
            points += 1
        else:
            print('Невірна відповідь')
        q22 = input('10х-7х - це? 1. Многочлен; 2. Рівняння; 3. Одночлен: ')
        if q22 == '3':
            print('Правильна відповідь.')
            points += 1
        else:
            print('Невірна відповідь')
        q32 = input('х-у - це? 1. Многочлен; 2. Рівняння; 3. Одночлен: ')
        if q32 == '1':
            print('Правильна відповідь.')
            points += 1
        else:
            print('Невірна відповідь')
        q42 = input('4х+9у=72 - це? 1. Многочлен; 2. Рівняння; 3. Одночлен: ')
        if q42 == '2':
            print('Правильна відповідь.')
            points += 1
        else:
            print('Невірна відповідь')
        q52 = input('Яке із чисел є простим? 1. 15; 2. 11; 3. 21: ')
        if q52 == '2':
            print('Правильна відповідь.')
            points += 1
        else:
            print('Невірна відповідь')
        q62 = input('Скільки розв\'язків має це рівняння: 2х+5=2х-3? 1. Безліч; 2. Один; 3. Жодного: ')
        if q62 == '3':
            print('Правильна відповідь.')
            points += 1
        else:
            print('Невірна відповідь')
            q72 = input('Скільки секунд у 2,5 годин? 1. 9000; 2. 8400; 3. 6000: ')
        if q72 == '1':
            print('Правильна відповідь.')
            points += 1
        else:
            print('Невірна відповідь')
        q82 = input('Корінь з якого числа дорівнює 15? 1. 225; 2. 215; 3. 125: ')
        if q82 == '1':
            print('Правильна відповідь.')
            points += 1
        else:
            print('Невірна відповідь')
        q92 = input('Яке число є НСК для 6 і 8? 1. 48; 2. 12; 3. 24: ')
        if q92 == '3':
            print('Правильна відповідь.')
            points += 1
        else:
            print('Невірна відповідь')
        q102 = input('Що більше 3/4 чи 0,7? 1. 0, 7; 2. Вони рівні; 3. 3/4: ')
        if q102 == '3':
            print('Правильна відповідь.')
            points += 1
        else:
            print('Невірна відповідь')
    print('Ти набрав(ла)', points, ' з 10')
elif theme == '3' :
    diff3 = input('Чудово! Вибери важкість. 1 - легка; 2 - важка: ')
    if diff3 == '1' :
        print(' Гаразд! Ось запитання.')
        points = 0
        q13 = input('Як називається точка де простір-час втрачають сенс у чорній дирі? 1. Горизонт подій; 2. Сингулярність; '
                    '3. Квантова флуктація: ')
        if q13 == '2':
            print('Правильна відповідь.')
            points += 1
        else:
            print('Невірна відповідь')
        q23 = input('Що таке червоне зміщення в спектрі далекої галактики? 1. Дифракція; 2. Свідчення розширення всесвіту'
                    '; 3. Гамма випромінювання: ')
        if q23 == '2':
            print('Правильна відповідь.')
            points += 1
        else:
            print('Невірна відповідь')
        q33 = input('Скільки триває світловий рік у днях? 1. 365; 2. 10000'
        '; 3. Ніскільки, це відстань: ')
        if q33 == '3':
            print('Правильна відповідь.')
            points += 1
        else:
            print('Невірна відповідь')
        q43 = input(
        'Як називається рівняння, яке описує розширення Всесвіту? 1. Рівняння Енштейна ; '
        '2. Рівняння Габбла; '
        '3. Рівняння Шредінгіра: ')
        if q43 == '2':
            print('Правильна відповідь.')
            points += 1
        else:
            print('Невірна відповідь')
        q53 = input('Який тип зорі закінчує життя, як наднова? 1. Масивна зоря; 2. Карликова зоря; 3. Люба зоря: ')
        if q53 == '1':
            print('Правильна відповідь.')
            points += 1
        else:
            print('Невірна відповідь')
            print('Ти набрав(ла)', points, ' з 5')
    elif diff3 == '2':
        points = 0
        print(' Гаразд! Ось запитання.')
        q13 = input('Як називається точка де простір-час втрачають сенс у чорній дирі? 1. Горизонт подій; 2. Сингулярність;'
                    ' 3. Квантова флуктація: ')
        if q13 == '2':
            print('Правильна відповідь.')
            points += 1
        else:
            print('Невірна відповідь')
        q23 = input('Що таке червоне зміщення в спектрі далекої галактики? 1. Дифракція; 2. Свідчення про розширення Всесвіта; '
                    '3. Гамма випромінювання: ')
        if q23 == '2':
            print('Правильна відповідь.')
            points += 1
        else:
            print('Невірна відповідь')
        q33 = input('Скільки триває світловий рік у днях? 1. 365; 2. 1000'
        '; 3. Ніскільки, це відстань: ')
        if q33 == '3':
            print('Правильна відповідь.')
            points += 1
        else:
            print('Невірна відповідь')
        q43 = input('Як називається рівняння, яке описує розирення Всесвіта; 1. Рівняння Ейнштейна '
            '2. Рівняння Габбла ; '
            '3. Рівняння Шредінгіра: ')
        if q43 == '2':
            print('Правильна відповідь.')
            points += 1
        else:
            print('Невірна відповідь')
        q53 = input('Який вид зорі закінчує життя, як наднова? 1. Масивна зоря; 2. Карликова зоря; 3. Люба зоря: ')
        if q53 == '1':
            print('Правильна відповідь.')
            points += 1
        else:
            print('Невірна відповідь')
        q63 = input('Що таке нейтронна зоря? 1. Газова хмара; 2. Карликова зоря; 3. Залишок наднової: ')
        if q63 == '3':
            print('Правильна відповідь.')
            points += 1
        else:
            print('Невірна відповідь')
        q73 = input('Що таке темна матерія? 1. Частинки з від\'ємною масою; 2. Антиречовина; '
                    '3. Невидима маса, що впливає на гравітацію: ')
        if q73 == '3':
            print('Правильна відповідь.')
            points += 1
        else:
            print('Невірна відповідь')
        q83 = input('Який тип спектра має розжарене тверде тіло? 1. Суцільний; 2. Лінійчатий; 3. Хвильовий: ')
        if q83 == '1':
            print('Правильна відповідь.')
            points += 1
        else:
            print('Невірна відповідь')
        q93 = input('Що таке фонова мікрохвильова радіація? 1.Радіохвилі від Сонця; 2. Сліди Великого Вибуху; '
                    '3. Порушення в телескопі: ')
        if q93 == '2':
            print('Правильна відповідь.')
            points += 1
        else:
            print('Невірна відповідь')
        q103 = input('Що таке епоха рекомбінації? 1. Перші роки Великого вибуху; 2. Коли плазма почала остигати; '
                     '3. Коли утворилася перша чорна діра: ')
        if q103 == '2':
            print('Правильна відповідь.')
            points += 1
        else:
            print('Невірна відповідь')
    print('Ти набрав(ла)', points, ' з 10')
elif theme == '4' :
    diff4 = input('Чудово! Вибери важкість. 1 - легка; 2 - важка: ')
    if diff4 == '1' :
        print(' Гаразд! Ось запитання.')
        points = 0
        q14 = input('Який орган здійснює синтез білка в клітині? 1. Мітохондрія; 2. Рибосома; 3. Лізосома: ')
        if q14 == '2':
            print('Правильна відповідь.')
            points += 1
        else:
            print('Невірна відповідь')
        q24 = input('Яка тканина транспортує воду у клітини? 1. Флоема; 2. Камбій; 3. Кселема: ')
        if q24 == '3':
            print('Правильна відповідь.')
            points += 1
        else:
            print('Невірна відповідь')
        q34 = input(
            'Яка спадкова одиниця передає ознаки від батьків до нащадків? 1. Ген; 2. Хромосома'
            '; 3. ДНК: ')
        if q34 == '1':
            print('Правильна відповідь.')
            points += 1
        else:
            print('Невірна відповідь')
        q44 = input(
            'Який процес відбувається під час фотосинтезу? 1. Вивільнення енергії з глюкози; 2. Поглинання кисню; '
            '3. Утворення вуглекислого газу: ')
        if q44 == '3':
            print('Правильна відповідь.')
            points += 1
        else:
            print('Невірна відповідь')
        q54 = input('Який орган людини відповідає за вироблення інсуліну? 1. Печінка; 2. Підшлункова залоза; 3. Нирки: ')
        if q54 == '2':
            print('Правильна відповідь.')
            points += 1
        else:
            print('Невірна відповідь')
            print('Ти набрав(ла)', points, ' з 5')
    elif diff4 == '2':
        points = 0
        print(' Гаразд! Ось запитання.')
        q14 = input('Який орган здійснює синтез білка в клітині? 1. Мітохондрія; 2. Рибосома; 3. Лізосома: ')
        if q14 == '2':
            print('Правильна відповідь.')
            points += 1
        else:
            print('Невірна відповідь')
        q24 = input('Яка тканина транспортує воду у клітини? 1. Флоема; 2. Камбій; 3. Кселема: ')
        if q24 == '3':
            print('Правильна відповідь.')
            points += 1
        else:
            print('Невірна відповідь')
        q34 = input(
            'Яка спадкова одиниця передає ознаки від батьків до нащадків? 1. Ген; 2. Хромосома'
            '; 3. ДНК: ')
        if q34 == '2':
            print('Правильна відповідь.')
            points += 1
        else:
            print('Невірна відповідь')
        q44 = input(
            'Який процес відбувається під час фотосинтезу? 1. Вивільнення енергії з глюкози; 2. Поглинання кисню; '
            '3. Утворення вуглекислого газу: ')
        if q44 == '3':
            print('Правильна відповідь.')
            points += 1
        else:
            print('Невірна відповідь')
        q54 = input('Який орган людини відповідає за вироблення інсуліну? 1. Печінка; 2. Підшлункова залоза; 3. Нирки: ')
        if q54 == '2':
            print('Правильна відповідь.')
            points += 1
        else:
            print('Невірна відповідь')
        q64 = input('Який тип розмноження не передбачає участі статевих клітин? 1. Статеве; 2. Перехресне; 3. Брунькування')
        if q64 == '3':
            print('Правильна відповідь.')
            points += 1
        else:
            print('Невірна відповідь')
            q74 = input('Скільки хромосом у людини? 1. 46; 2. 42; 3. 47: ')
        if q74 == '1':
            print('Правильна відповідь.')
            points += 1
        else:
            print('Невірна відповідь')
        q84 = input('Як називається період подвоєння ДНК у клітин? 1. Інтерфаза; 2. Анафаза; 3. Телофаза: ')
        if q84 == '1':
            print('Правильна відповідь.')
            points += 1
        else:
            print('Невірна відповідь')
        q94 = input(
            'Яка система організму відповідає за захист від інфекцій? 1. Видільна; 2. Нервова; 3. Імунна: ')
        if q94 == '3':
            print('Правильна відповідь.')
            points += 1
        else:
            print('Невірна відповідь')
        q104 = input('Який вид відносин між організмами є взаємовигідним? 1. Хижацтво; 2. Паразитизм; 3. Симбіоз: ')
        if q104 == '3':
            print('Правильна відповідь.')
            points += 1
        else:
            print('Невірна відповідь')
    print('Ти набрав(ла)', points, ' з 10')
elif theme == '5' :
    diff5 = input('Чудово! Вибери важкість. 1 - легка; 2 - важка: ')
    if diff5 == '1' :
        print(' Гаразд! Ось запитання.')
        points = 0
        q15 = input('Який елемент є металом? 1. Сірка; 2. Натрій; 3. Кисень: ')
        if q15 == '2':
            print('Правильна відповідь.')
            points += 1
        else:
            print('Невірна відповідь')
        q25 = input('Який оксид утворює кислоту при взаємодії з водою? 1. CaO; 2. MgO; 3. SO3: ')
        if q25 == '3':
            print('Правильна відповідь.')
            points += 1
        else:
            print('Невірна відповідь')
        q35 = input(
            'Яка формула гідроксиду кальцію? 1. CaOH; 2. Ca(OH)2'
            '; 3. Ca2OH: ')
        if q35 == '2':
            print('Правильна відповідь.')
            points += 1
        else:
            print('Невірна відповідь')
        q45 = input(
            'Що є продуктами реакції нейтралізації кислоти з основою? 1.Оксид і вода ; 2. Сіль і кисень; '
            '3. Сіль і вода: ')
        if q45 == '3':
            print('Правильна відповідь.')
            points += 1
        else:
            print('Невірна відповідь')
        q55 = input('Який газ виділяється при реакції кислоти з металом? 1. Кисень; 2. Водень; 3. Азот: ')
        if q55 == '2':
            print('Правильна відповідь.')
            points += 1
        else:
            print('Невірна відповідь')
            print('Ти набрав(ла)', points, ' з 5')
    elif diff5 == '2':
        points = 0
        print(' Гаразд! Ось запитання.')
        q15 = input('Який елемент є металом? 1. Сірка; 2. Натрій; 3. Кисень: ')
        if q15 == '2':
            print('Правильна відповідь.')
            points += 1
        else:
            print('Невірна відповідь')
        q25 = input('Який оксид утворює кислоту при взаємодії з водою? 1. CaO; 2. MgO; 3. SO3: ')
        if q25 == '3':
            print('Правильна відповідь.')
            points += 1
        else:
            print('Невірна відповідь')
        q35 = input(
            'Яка формула гідроксиду кальцію? 1. CaOH; 2. Ca(OH)2'
            '; 3. Ca2OH: ')
        if q35 == '2':
            print('Правильна відповідь.')
            points += 1
        else:
            print('Невірна відповідь')
        q45 = input(
            'Що є продуктами реакції нейтралізації кислоти з основою? 1.Оксид і вода ; 2. Сіль і кисень; '
            '3. Сіль і вода: ')
        if q45 == '3':
            print('Правильна відповідь.')
            points += 1
        else:
            print('Невірна відповідь')
        q55 = input('Який газ виділяється при реакції кислоти з металом? 1. Кисень; 2. Водень; 3. Азот: ')
        if q55 == '2':
            print('Правильна відповідь.')
            points += 1
        else:
            print('Невірна відповідь')
        q65 = input('Який елемент має найбільшу електронегативність? 1. Флуор; 2. Хлор; 3. Камінь: ')
        if q65 == '1':
            print('Правильна відповідь.')
            points += 1
        else:
            print('Невірна відповідь')
        q75 = input('Що проводить електричний струм? 1. Глюкоза; 2. Дистильовона вода; 3. NACl у воді: ')
        if q75 == '3':
            print('Правильна відповідь.')
            points += 1
        else:
            print('Невірна відповідь')
        q85 = input('Яка з речовин є вуглеводом? 1. C2H6; 2. CH3OH; 3. CO2: ')
        if q85 == '1':
            print('Правильна відповідь.')
            points += 1
        else:
            print('Невірна відповідь')
        q95 = input(
            'Яка маса одного моля води? 1. 16 г; 2. 20 г; 3. 18 г: ')
        if q95 == '3':
            print('Правильна відповідь.')
            points += 1
        else:
            print('Невірна відповідь')
        q105 = input('Який продукт утворюється при повному згорянні метану? 1. CO i H2; 2. CH3OH; 3. CO2 i H2O: ')
        if q105 == '3':
            print('Правильна відповідь.')
            points += 1
        else:
            print('Невірна відповідь')
    print('Ти набрав(ла)', points, ' з 10')